Revit 2027 API
SpatialElementBoundaryOptions Constructor
 Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementBoundaryOptions()
Public Sub New
public:
SpatialElementBoundaryOptions()
new : unit -> SpatialElementBoundaryOptions
See Also
Reference
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace